package com.example.homework13_1

import com.example.homework13_1.db.Films

data class MyItem(val name: String, val author: String,val year: String, val description: String)


val ItemsDB = listOf(

Films("Игры дьявола", "Сидни Люмет", "2007","Драма, Триллер"),
Films("На глубине 6 футов", "Скотт Во", "2019","Спорт, Биография, Драма"),
Films("Мой брат супергерой", "Антония Нава", "2019","Комедия, Драма, Семейный"),
Films("Рыба-мечта", "Антон Бильжо", "2016","Комедия, Мелодрама, Триллер"),
Films("Фантазеры", "Федерика Лучизано", "2018","Комедия"),
Films("Матрица", "Лилли Вачовска", "1999","фантастика, про боевые исскуства"),
Films("Замыкая круг", "Ричард Аттенборо", "2007","мелодрама, Драма"),
Films("Развод по-американски", "Пейтон Рид", "2006","Комедия, мелодрама, драма"),
Films("Марли и Я", "Девид Френкел", "2008","Комедия, драма, семейный"),
Films("На другом конце провода", "Джеймс Додсон", "2008","Комедия, мелодрама, драма")
)
